{"eventsMonday":{"2s0UkIW4GuYTeANqoUrr":{"eventsInfo":"Your organization is doing okay. You’ve had success, maybe some recognition, and a solid financial foundation, but you have a vision for more. Colleagues, employees and customers think                               you’ve done very well. But you know there’s more for you and your organization. In this high energy, culture changing presentation, Wynn will share: <br><br>                                - What’s in the way of creating your bigger impact and how to move into “what’s possible?”<br>                               - How to ignite passion, purpose and caring in your team to create a “win-win” attitude.<br>                               - The Keys to shift the culture of your entire organization into a workplace of cooperation, joy and productivity.<br><br>                                Wynn Godbold, Bee Sharp Professional Training<br><br>                                TARGET AUDIENCE: Executive Directors, Supervisors, Managers, people with aspiration","eventsOrder":5,"eventsLocation":"Location | Kensington F","eventsTime":"9:00am - 12:00pm | Concurrent Pre-Conference Workshop C)","eventsTitle":"Moving from the Impossible to the Possible. Developing Leadership From the Inside Out"},"3T4JdkafgtVqakifQS7J":{"eventsTime":"1:00pm - 1:30pm | Official Opening Of The Full Conference","eventsLocation":"Location | Kensington ABCG","eventsTitle":"Roaring Into the 20’s; Ready Set, Here We Come","eventsOrder":7,"eventsInfo":"Known for their outrageous behavior at times, the Conference Planning Committee will welcome you in style. Be prepared to laugh and make new friends at your table as we work together during the next three days."},"6uBHNoZQa5qD2dFinSq8":{"eventsTime":"3:00pm - 4:00pm | Concurrent Session C)","eventsTitle":"Roaring Into Employment First- What’s a Case Manager To Do?","eventsOrder":12,"eventsLocation":"Location | Kensington F","eventsInfo":"The new employment module is live in Therap! Come take a look and learn techniques for monitoring employment and other provided services. What do I need to do to get someone employed and help ensure they stay that way?<br><br> Therap Team: Jeff Covington, Deputy Director of State Implementation; Ben Orner, Director of Program Integrity and Service Utilization, SCDDSN"},"AhQV0S634N9qXgXTHWhv":{"eventsInfo":"Come explore all the various data that Therap has available and ways that the data can                               be used to monitor your own work flow and due dates or the workflow of your staff.<br><br>                                Therap Team: Jeff Covington, Deputy Director of State Implementation; Ben Orner,                               Director of Program Integrity and Service Utilization, SCDDSN<br><br>                                TARGET AUDIENCE: Case Managers, Case Manager Supervisors, Case Management program staff","eventsOrder":3,"eventsLocation":"Location | Kensington D","eventsTitle":"Using Therap: What you Didn’t Know You Could Do With the Data in Therap","eventsTime":"9:00am - 12:00pm | Concurrent Pre-Conference Workshop A)"},"Dd8Mc9l9Rt4inUYwFeCu":{"eventsLocation":"Location | Kensington D","eventsInfo":"The 1920’s was a time when many in the U.S. redefined themselves. There was a break with tradition and people embraced changes in lifestyles and culture. People were excited as things began to move at a faster pace with telephones, radio, appliances, automobiles and aviation. The 1920’s gave us new-found freedoms and society never looked back. But, should we? In our role of supporting people to become as independent as possible, are we overlooking innovation in our service system? Is there a better way to meet the needs of people we are supporting? In this session we will take a look at what Medicaid says we have to do as providers of Residential Habilitation and the opportunities providers have to make the 2020’s a decade of learning and growth. Please join our discussion!<br><br> Ann Dalton, Director Quality Management Division, SC Department of Disabilities and Special Needs","eventsTime":"3:00pm - 4:00pm | Concurrent Session A)","eventsOrder":10,"eventsTitle":"Redefining the Culture of Support in South Carolina: Taking our “requirements” to the next level to promote a better quality of life."},"LOLuX6ShfJw87tNZJcTK":{"eventsTime":"1:30pm - 2:30pm | Plenary Session","eventsOrder":8,"eventsInfo":"Today, there is far too much gloom and doom in the media and news both about where we’re headed as a society and about the coming challenges we face. And while those may be true, they don’t overshadow or erase the enormous strides and technical progress that we have made as a society over the past century. This session will give better insights for how managers and leaders can adopt an optimistic mindset that affects every area of their work and engagement in our world today. There are definitely challenges in our world, but there are many reasons why this may be one of the greatest times to be alive. This session will motivate you to embrace that mindset and to help you shift your thinking from one of doom and gloom to tremendous optimism amidst an age of amazing technological advancement and progress.<br><br>Robert Charles, JD, CPA, MBA","eventsLocation":"Location | Kensington ABCG","eventsTitle":"Leading in the Age of Abundance"},"LatnZhbs5N69b9s8ez9X":{"eventsTitle":"Human Trafficking in South Carolina: The Reality and the Response","eventsOrder":11,"eventsTime":"3:00pm - 4:00pm | Concurrent Session B)","eventsInfo":"This presentation will cover the scope of human trafficking internationally, nationally and throughout SC. Attendees will learn the definition of human trafficking, the approaches taken by those who target victims, who is most acutely impacted by the crime, and how the community can safely respond to suspected human trafficking incidents.<br><br> Kathryn Moorehead, Director, VAWA and Human Trafficking Coordinator, SC Human Trafficking Task Force, Office of the Attorney General","eventsLocation":"Location | Kensington E"},"OWdRtfq3mNsVMP0NKH3J":{"eventsTitle":"Event | Exhibits and Sponsors","eventsLocation":"Location | Westminster Hall, Cambridge Hall,  and Balmoral Hall","eventsInfo":"N/A","eventsTime":"12:00pm - 4:30pm | Exhibits and Sponsors","eventsOrder":2},"W1M3FyncRXhwpjb4LUno":{"eventsOrder":1,"eventsTime":"8:00am - 4:00pm | Registration","eventsLocation":"Location | Cambridge Hall","eventsTitle":"Registration","eventsInfo":"N/A"},"azmA7iCqNipZRfrbm3me":{"eventsOrder":15,"eventsLocation":"Night Watch (2nd floor off the elevators and to the right)","eventsTime":"8:30pm - 11:00pm | Hospitality Suite","eventsTitle":"Hospitality Suite","eventsInfo":"Enjoy refreshments and music in the hospitality suite!<br><br> Sponsored by Craig Thornton – Marsh & McLennan Agency"},"pbOoOsuG4HdLTgfSNx0U":{"eventsInfo":"Sponsored by Hodge Systems<br><br> Music Provided by Ice Box Productions and DJ Pat Taylor. In addition to his mobile DJ work, Pat serves as a Next Media On-Air Personality for WKZO, WAVE 104.1, STAR 92.1 and WRNN 99.5","eventsOrder":14,"eventsLocation":"Location | Kensington ABCG","eventsTime":"5:30pm - 7:30pm | Reception and Costume Contest, come dressed in Roaring 20s attire!","eventsTitle":"Reception and Costume Contest, come dressed in Roaring 20s attire!"},"s9wbH7or8BHoxTBapakD":{"eventsInfo":"Enabling Technology as another tool to support individuals is emerging as a national best practice approach to services. This session will explore the benefits and risks associated with                               implementing programs that use enabling technology. Particular attention will be given to program design & management with special attention towards complying with the final rule, risk management and organizational                               change. Careful consideration will also be given to the appropriate use and implementation of technology.<br><br>                                Gerald Bernard, Executive Director, the Charles Lea Center, Harold Sloves, Director of Program Innovation, Tennessee Department of Intellectual and Developmental Disabilities and Jason Ray, CEO, Simply Home<br><br>                                TARGET AUDIENCE: Executive Directors, Residential Staff, Coordinators, House                               Managers, Direct Support Professionals, Behavior Support Professionals, Health Care Professionals","eventsLocation":"Location | Winchester","eventsOrder":6,"eventsTitle":"Enabling Technology: National, State and Local Perspectives; Opportunities and Challenges","eventsTime":"9:00am - 12:00pm | Concurrent Pre-Conference Workshop D)"},"sSVreLKBRW8FMFUn5Sr1":{"eventsInfo":"The Health Risk Screening Tool (HRST) is a standardized tool used to determine a person’s vulnerability to present and potential health risks. It also provides early identification of deteriorating health, even when signs are not obvious. The HRST Health Care Level has been shown in multiple studies to be directly related to mortality. This means that the HRST can not only help improve quality of health but also increases the chance of avoiding unnecessary, premature deaths.<br><br> Hilary Gayton, Business Development Representative, Health Risk Screening, Inc. and Johnathon Crumley, Senior Director of Operations, Health Risk Screening, Inc.","eventsOrder":13,"eventsTitle":"The Health Risk Screening Tool (HRST): Its Use in Health Risk Identification and Preventing Early Death","eventsTime":"3:00pm - 4:00pm | Concurrent Session D)","eventsLocation":"Location | Winchester"},"uPLd5X4yTXwMtvKbRwjX":{"eventsOrder":4,"eventsLocation":"Location | Kensington E","eventsInfo":"Utilizing a PowerPoint and panel discussion format, speakers will demonstrate how to use person centered thinking to complete a                               Personal Focus Worksheet and ISP Agenda in Therap to support compliance with the HCBS Settings Rule. <br><br>                                Donna Hall, Deputy Director, the Babcock Center, David Kammerer, Director of Staff Development, the Babcock Center and Richard Cummings, Director of Quality Assurance, the Babcock Center.<br><br>                                TARGET AUDIENCE: Coordinators, Program Managers, Supervisors, QA staff, waiver participants and Direct Support Professionals","eventsTitle":"Person Centered Thinking: Bringing It All Together","eventsTime":"9:00am - 12:00pm | Concurrent Pre-Conference Workshop B)"},"zh6pq274Ktrywyu2Jzid":{"eventsTime":"2:30pm - 3:00pm | Break","eventsTitle":"Break","eventsOrder":9,"eventsInfo":"Sponsored by Sharp USA","eventsLocation":"N/A"}}}